app/controllers/albums_controller.rb

	def create
		@album = Album.new(params[:album])
		if @album.save
---
INSERT INTO `albums` (`created_at`, `description`, `name`, `title`, `updated_at`) VALUES ('2013-08-14 11:18:01', 'My Photos', 'Ramans', 'self', '2013-08-14 11:18:01')

	def index
		@albums = Album.all
---
SELECT `albums`.* FROM `albums`

	def show
		@album = Album.find(params[:id])
---
SELECT `albums`.* FROM `albums` WHERE `albums`.`id` = 1 LIMIT 1