app/controllers/comments_controller.rb

	def create
		@comment = Comment.new(params[:comment])
		 if @comment.save
---
INSERT INTO `comments` (`created_at`, `message`, `photo_id`, `updated_at`) VALUES ('2013-08-16 05:55:58', 'gfgfgfgfgfgfg', 1, '2013-08-16 05:55:58')

	def index
		@coments = Comment.all
---
SELECT `comments`.* FROM `comments`