app/controllers/photos_controller.rb

	def create
	   	@photo = Photo.new(params[:photo])
	   	if @photo.save
---
INSERT INTO `photos` (`album_id`, `created_at`, `description`, `image`, `image_content_type`, `image_file_name`, `image_file_size`, `name`, `title`, `updated_at`) VALUES (NULL, '2013-08-16 05:11:15', 'dfdfdfdfdf', NULL, 'image/jpeg', 'ntr.jpg', 12866, 'dffdfdfdfd', 'dfdfdfdffdfdf', '2013-08-16 05:11:15')

	def index
		@photos = Photo.all
---
SELECT `photos`.* FROM `photos`

	def show
		@photo = Photo.find(params[:id])
---
SELECT `photos`.* FROM `photos` WHERE `photos`.`id` = 1 LIMIT 1